# СОЗДАЕМ ЧИСТЫЙ ЛИСТ
paper = {'00': '-', '01': '-', '02': '-', '10': '-', '11': '-', '12': '-', '20': '-', '21': '-', '22': '-'}
game_status = 'start'  # устанавливаем начальный статус
game_result = ''


# ФУНКЦИИ:
# ==ВЕРСТКА ИГРОВОГО ПОЛЯ ДЛЯ ВЫВОДА В КОНСОЛЬ
def show_paper():
    a = '  0 1 2\n0 '
    a += paper['00']
    a += ' ' + paper['01']
    a += ' ' + paper['02']
    a += '\n1 ' + paper['10']
    a += ' ' + paper['11']
    a += ' ' + paper['12']
    a += '\n2 ' + paper['20']
    a += ' ' + paper['21']
    a += ' ' + paper['22']
    return a
# ============================================


# ======Приглашение в игру
print('Выберите:\n"X" - начинает первым\n"O" - делает ход вторым')
gamer_symbol = str(input('Чем будете играть? '))

# ПРОВЕРКА ВВОДА
if gamer_symbol == 'X' or gamer_symbol == 'x' or gamer_symbol == 'Х' or gamer_symbol == 'х':
    gamer = ['X']
    comp = ['O']
    print('Вы выбрали "X", делайте первый ход!\n')
else:
    print('Вы не выбрали "X", первый ход за мной!\n')
    gamer = ['O']
    comp = ['X', '11']
    paper['11'] = 'X'

while game_status == 'start':
    print(show_paper())  # ВЫВОД ИГРОВОГО ПОЛЯ В КОНСОЛЬ

    print('Введите координаты Вашего хода в виде двухзначного числа в формате: VG (V-вертикаль, G-горизонталь)')
    print('ВНИМАНИЕ! НЕВЕРНЫЕ КООРДИНАТЫ = ПРОПУСК ХОДА!!!')
    gamer_action = str(input('Ваш ход: '))
    gamer.append(gamer_action)

    # ПРОВЕРКА ЗАНЯТО ЛИ МЕСТО КОМПЬЮТЕРОМ
    for x in comp:
        if x == gamer_action:
            print('Это место занято!\n')
            gamer_action = '99'
            gamer[(len(gamer) - 1)] = '99'
    paper[gamer_action] = gamer[0]

    # ПРОВЕРКА ОКОНЧАНИЯ ИГРЫ==================================

    # СКАНИРОВАНИЕ ВЫИГРЫШНЫХ КОМБИНАЦИЙ
    result = [str(paper['00'] + paper['01'] + paper['02']),
              str(paper['10'] + paper['11'] + paper['12']),
              str(paper['20'] + paper['21'] + paper['22']),
              str(paper['00'] + paper['10'] + paper['20']),
              str(paper['01'] + paper['11'] + paper['21']),
              str(paper['02'] + paper['12'] + paper['22']),
              str(paper['00'] + paper['11'] + paper['22']),
              str(paper['20'] + paper['11'] + paper['02']), ]

    # ПРОВЕРКА ВЫИГРЫША ИГРОКА ИЛИ КОМПЬЮТЕРА
    for x in result:
        if x == str(gamer[0] + gamer[0] + gamer[0]):
            game_result = '\nПОЗДРАВЛЯЮ! Победа за Вами!!!'
            game_status = 'END'  # статус для выхода из цикла
        if x == str(comp[0] + comp[0] + comp[0]):
            game_result = '\nМоя взяла!!!'
            game_status = 'END'  # статус для выхода из цикла
    # ==========================================================

    # ГЕНЕРАТОР ХОДА КОМПЬЮТЕРА
    # 1. ПРОВЕРКА СТАТУСА ИГРЫ (game_status == 'start')
    # 2. Если не занято место в центре (11), занимаем
    # 3. Если есть вариант закончить с победой: 'XX-', '-XX' или 'X-X', то заканчиваем игру
    # 4. Если игрок близок к победе: 'XX-', '-XX' или 'X-X', то закрываем пустое место
    # 5. Продолжаем любой вариант: 'X--', '-X-' или '--X'

    # ТЕСТИРОВАНИЕ ВНУТРИ ЦИКЛА========================================
    print(result)
    print('Элементов в списке: ' + str(len(gamer)) + '\n' + str(gamer))
    # =================================================================

# ВЫВОД РЕЗУЛЬТАТА ИГРЫ
print(game_result)
print(show_paper())
# ========================
